In [2]:
import mysql.connector
import pandas as pd

In [3]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'retrowheels'
)

In [4]:
mycursor = mydb.cursor()

query = 'select * from employees'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head(5)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

SOAL NO. 1

In [6]:
mycursor = mydb.cursor()

query = 'select count(distinct customernumber) from customers'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct customernumber)
0                             122

In [7]:
mycursor = mydb.cursor()

query = 'select count(distinct city) from customers'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct city)
0                    95

In [8]:
mycursor = mydb.cursor()

query = 'select count(distinct country) from customers'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct country)
0                       27

SOAL  NO. 2

In [9]:
mycursor = mydb.cursor()

query = 'select count(distinct employeenumber) from employees'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct employeenumber)
0                              23

In [10]:
mycursor = mydb.cursor()

query = 'select count(distinct officecode) from offices'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct officecode)
0                           7

In [11]:
mycursor = mydb.cursor()

query = 'select count(distinct country) from offices'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct country)
0                        5

In [14]:
mycursor = mydb.cursor()

query = 'select count(distinct productcode) from products'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct productcode)
0                          110

In [12]:
mycursor = mydb.cursor()

query = 'select sum(quantityinstock) from products'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

  sum(quantityinstock)
0               555131

In [15]:
mycursor = mydb.cursor()

query = 'select count(distinct productvendor) from products'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   count(distinct productvendor)
0                             13

SOAL NO. 3

In [16]:
mycursor = mydb.cursor()

query = 'select distinct (productline), min(buyprice), max(buyprice) from products group by productline'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

        productline min(buyprice) max(buyprice)
0      Classic Cars         15.91        103.42
1       Motorcycles         24.14         91.02
2            Planes         29.34         77.27
3             Ships         33.30         82.34
4            Trains         26.72         67.56
5  Trucks and Buses         24.92         84.76
6      Vintage Cars         20.61         86.70

SOAL NO. 4

In [21]:
mycursor = mydb.cursor()

query = 'select customername, city, country, sum(amount) as total from customers, payments where customers.customernumber = payments.customernumber group by customers.customernumber order by total desc limit 10'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

                   customername           city      country      total
0        Euro+ Shopping Channel         Madrid        Spain  715738.98
1  Mini Gifts Distributors Ltd.     San Rafael          USA  584188.24
2    Australian Collectors, Co.      Melbourne    Australia  180585.07
3            Muscle Machine Inc            NYC          USA  177913.95
4       Dragon Souveniers, Ltd.      Singapore    Singapore  156251.03
5    Down Under Souveniers, Inc     Auckland    New Zealand  154622.08
6                AV Stores, Co.     Manchester           UK  148410.09
7       Anna's Decorations, Ltd   North Sydney    Australia  137034.22
8      Corporate Gift Ideas Co.  San Francisco          USA  132340.78
9        Saveley & Henriot, Co.           Lyon       France  130305.35